soap_client/xml_templates/soap/download_file_list.xml

<?xml version="1.0" encoding="UTF-8"?> 
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"> 
    <env:Body xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"> 
        <cor:downloadFileListin xmlns:cor="http://bxd.fi/CorporateFileService"> 
            <bxd:RequestHeader xmlns:bxd="http://model.bxd.fi"> 
                <bxd:SenderId></bxd:SenderId>
                <bxd:RequestId></bxd:RequestId> 
                <bxd:Timestamp></bxd:Timestamp> 
                <bxd:Language></bxd:Language> 
                <bxd:UserAgent></bxd:UserAgent> 
                <bxd:ReceiverId></bxd:ReceiverId> 
            </bxd:RequestHeader> 
            <bxd:ApplicationRequest xmlns:bxd="http://model.bxd.fi"></bxd:ApplicationRequest> 
        </cor:downloadFileListin> 
    </env:Body> 
</env:Envelope>
