lib/sepa/xml_templates/soap/danske_upload_file.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <soap:Body wsu:Id="Id-298985fc-01d3-4d4a-b5db-f11d75ee6aca">
        <uploadFilein xmlns="http://bxd.fi/CorporateFileService">
            <RequestHeader xmlns="http://model.bxd.fi">
                <SenderId></SenderId>
                <RequestId></RequestId>
                <Timestamp></Timestamp>
                <Language></Language>
                <UserAgent></UserAgent>
                <ReceiverId></ReceiverId>
            </RequestHeader>
            <ApplicationRequest xmlns="http://model.bxd.fi"></ApplicationRequest>
        </uploadFilein>
    </soap:Body>
</soap:Envelope>